{
    "comments": [
        {
            "post_id": 1,
            "post_comment": "Hope Ahmed Ali is found safe and sound soon!",
            "user": "ConcernedCitizen1",
            "date": "2023-11-13"
        },
        {
            "post_id": 3,
            "post_comment": "My thoughts and prayers are with Ahmed Ali's family during this difficult time.",
            "user": "Empathy2024",
            "date": "2023-11-14"
        },
        {
            "post_id": 3,
            "post_comment": "This is heartbreaking news. I hope Ahmed Ali is found soon. Stay strong, Egypt.",
            "user": "SolidarityForever",
            "date": "2023-11-14"
        },
        {
            "post_id": 3,
            "post_comment": "As a parent, I can't even begin to imagine what Ahmed Ali's family is going through. Let's spread awareness and help in any way we can.",
            "user": "Parenting101",
            "date": "2023-11-15"
        },
        {
            "post_id": 5,
            "post_comment": "Ahmed Ali, wherever you are, please know that many people are hoping for your safe return. Stay strong!",
            "user": "HopeForAhmed",
            "date": "2023-11-15"
        },
        {
            "post_id": 6,
            "post_comment": "It's concerning to see cases like this. Let's all keep an eye out and report any relevant information to authorities.",
            "user": "VigilantCitizen",
            "date": "2023-11-16"
        },
        {
            "post_id": 7,
            "post_comment": "Praying for Ahmed Ali's safety and for his family's peace of mind.",
            "user": "FaithfulHeart",
            "date": "2023-11-17"
        },
        {
            "post_id": 8,
            "post_comment": "Ahmed Ali, you are not forgotten. We will continue to spread the word until you are safely reunited with your loved ones.",
            "user": "NeverGiveUpHope",
            "date": "2023-11-17"
        },
        {
            "post_id": 9,
            "post_comment": "Let's all share this post and help increase the chances of finding Ahmed Ali. Every share counts!",
            "user": "ShareForAwareness",
            "date": "2023-11-18"
        },
        {
            "post_id": 3,
            "post_comment": "Ahmed Ali, may you find strength and courage wherever you are. We are all rooting for your safe return.",
            "user": "StrengthInUnity",
            "date": "2023-11-18"
        },
        {
            "post_id": 11,
            "post_comment": "This hits close to home. Let's all come together as a community to support Ahmed Ali's family and help bring him back.",
            "user": "CommunitySupport",
            "date": "2023-11-19"
        },
        {
            "post_id": 12,
            "post_comment": "Sending love and prayers to Ahmed Ali's family. We will keep hoping and searching until he is found.",
            "user": "LoveAndPrayers",
            "date": "2023-11-19"
        },
        {
            "post_id": 3,
            "post_comment": "Let's not lose hope. Every effort, big or small, contributes to the search for Ahmed Ali.",
            "user": "HopefulHeart",
            "date": "2023-11-20"
        },
        {
            "post_id": 14,
            "post_comment": "Ahmed Ali, your family misses you dearly. We won't stop until you're back in their arms.",
            "user": "FamilyFirst",
            "date": "2023-11-20"
        },
        {
            "post_id": 15,
            "post_comment": "Let's keep sharing Ahmed Ali's story. Someone out there might have valuable information that could bring him home.",
            "user": "SpreadTheWord",
            "date": "2023-11-21"
        },
        {
            "post_id": 3,
            "post_comment": "This is a reminder to hold your loved ones close. Life is precious and unpredictable. Ahmed Ali, we're all hoping for your safe return.",
            "user": "CherishEveryMoment",
            "date": "2023-11-21"
        },
        {
            "post_id": 17,
            "post_comment": "Ahmed Ali, you are not alone. The community stands with you and your family during this difficult time.",
            "user": "CommunitySupporter",
            "date": "2023-11-22"
        },
        {
            "post_id": 18,
            "post_comment": "Let's turn our thoughts into action. Share information, raise awareness, and support Ahmed Ali's family in any way we can.",
            "user": "ActionSpeaksLouder",
            "date": "2023-11-22"
        },
        {
            "post_id": 19,
            "post_comment": "Praying for Ahmed Ali's safe return. May he be found soon.",
            "user": "PrayerCircle",
            "date": "2023-11-23"
        },
        {
            "post_id": 3,
            "post_comment": "Ahmed Ali's family deserves answers and closure. Let's keep the momentum going until he is found.",
            "user": "AnswersAndClosure",
            "date": "2023-11-23"
        }
    ]
}